app/controllers/opportunities_controller.rb

SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]
---
    def index
        @opportunity = Opportunity.where(:user_id => session[:user_id]).order("created_at DESC")

INSERT INTO "opportunities" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2021-04-28 01:43:03.122184"], ["updated_at", "2021-04-28 01:43:03.122184"], ["user_id", 2]]
---
    def create
        @opportunity = Opportunity.new(opportunity_params)
        @opportunity.user_id = session[:user_id]
        @opportunity.save

SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "opportunities" SET "signature" = $1, "updated_at" = $2 WHERE "opportunities"."id" = $3  [["signature", "Verified"], ["updated_at", "2021-04-28 04:25:59.599507"], ["id", 48]]
---
    def show
        @opportunity = Opportunity.find(params[:id])
        @opportunity.update_attribute('signature', 'Verified')

SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
---
    def edit
        @opportunity = Opportunity.find(params[:id])

SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "opportunities" WHERE "opportunities"."id" = $1  [["id", 49]]
---
    def destroy
        @opportunity = Opportunity.find(params[:id])
        @opportunity.destroy